Revit 2026 API

# FilterableValueProviderGetIntegerValue Method

---

Gets an integer value from the given element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetIntegerValue(
	Element element
)
```
```vb
Public Function GetIntegerValue (
	element As Element
) As Integer
```
```cpp
public:
int GetIntegerValue(
	Element^ element
)
```
```fsharp
member GetIntegerValue :
        element : Element -> int
```

#### Parameters

element Element
     The element to query.

#### Return Value

Int32 The integer value from the element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterableValueProvider Class

Autodesk.Revit.DB Namespace